MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\UART.h
/*******************************************************************************
* File Name: UART.h
* Version 2.0
*
* Description:
*  Contains the function prototypes and constants available to the UART
*  user module.
*
* Note:
*
********************************************************************************
* Copyright 2008-2010, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/


#include "cytypes.h"
#include "cyfitter.h"

#if !defined(CY_UART_UART_H)
#define CY_UART_UART_H


/***************************************
* Conditional Compilation Parameters
***************************************/

#define UART_RX_ENABLED                     (1u)
#define UART_TX_ENABLED                     (1u)
#define UART_HD_ENABLED                     (0u)
#define UART_RX_INTERRUPT_ENABLED           (1u)
#define UART_TX_INTERRUPT_ENABLED           (1u)
#define UART_INTERNAL_CLOCK_USED            (1u)
#define UART_RXHW_ADDRESS_ENABLED           (0u)
#define UART_OVER_SAMPLE_COUNT              (8u)
#define UART_PARITY_TYPE                    (0u)
#define UART_PARITY_TYPE_SW                 (0u)
#define UART_BREAK_DETECT                   (0u)
#define UART_BREAK_BITS_TX                  (13u)
#define UART_BREAK_BITS_RX                  (13u)
#define UART_TXCLKGEN_DP                    (1u)
#define UART_USE23POLLING                   (0u)

/* PSoC3 ES2 or early */
#define UART_PSOC3_ES2  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_3A) && \
                                     (CYDEV_CHIP_REVISION_USED <= CYDEV_CHIP_REVISION_3A_ES2))

/* PSoC5 ES1 or early */
#define UART_PSOC5_ES1  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_5A) && \
                                     (CYDEV_CHIP_REVISION_USED <= CYDEV_CHIP_REVISION_5A_ES1))
/* PSoC3 ES3 or later */
#define UART_PSOC3_ES3  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_3A) && \
                                     (CYDEV_CHIP_REVISION_USED > CYDEV_CHIP_REVISION_3A_ES2))

/* PSoC5 ES2 or later */
#define UART_PSOC5_ES2  ((CYDEV_CHIP_MEMBER_USED == CYDEV_CHIP_MEMBER_5A) && \
                                     (CYDEV_CHIP_REVISION_USED > CYDEV_CHIP_REVISION_5A_ES1))

#if(UART_PSOC3_ES2 && (UART_RX_INTERRUPT_ENABLED || UART_TX_INTERRUPT_ENABLED))
    #include <intrins.h>
    #define UART_ISR_PATCH() _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_();
#endif /* End PSOC3_ES2 */

#ifdef UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG
    #define UART_CONTROL_REG_REMOVED            (0u)
#else
    #define UART_CONTROL_REG_REMOVED            (1u)
#endif /* End UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG */


/***************************************
*      Data Struct Definition
***************************************/

/* Sleep Mode API Support */
typedef struct _UART_backupStruct
{
    uint8 enableState;

    #if(UART_CONTROL_REG_REMOVED == 0u)
        uint8 cr;            
    #endif /* End UART_CONTROL_REG_REMOVED */    
    #if( (UART_RX_ENABLED) || (UART_HD_ENABLED) )
        uint8 rx_period;
        #if (UART_PSOC3_ES2 || UART_PSOC5_ES1) /* PSoC3 ES2 or early, PSoC5 ES1*/
            uint8 rx_mask;
            #if (UART_RXHW_ADDRESS_ENABLED)
                uint8 rx_addr1;
                uint8 rx_addr2;
            #endif /* End UART_RXHW_ADDRESS_ENABLED */
        #endif /* End PSOC3_ES2 || PSOC5_ES1 */
    #endif  /* End (UART_RX_ENABLED) || (UART_HD_ENABLED)*/

    #if(UART_TX_ENABLED)
        #if(UART_TXCLKGEN_DP)
            uint8 tx_clk_ctr;
            #if (UART_PSOC3_ES2 || UART_PSOC5_ES1) /* PSoC3 ES2 or early, PSoC5 ES1*/
                uint8 tx_clk_compl;
            #endif  /* End PSOC3_ES2 || PSOC5_ES1 */
        #else
            uint8 tx_period;
        #endif /*End UART_TXCLKGEN_DP */
        #if (UART_PSOC3_ES2 || UART_PSOC5_ES1) /* PSoC3 ES2 or early, PSoC5 ES1*/
            uint8 tx_mask;
        #endif  /* End PSOC3_ES2 || PSOC5_ES1 */
    #endif /*End UART_TX_ENABLED */
} UART_BACKUP_STRUCT;


/***************************************
*       Function Prototypes
***************************************/

void UART_Start(void);
void UART_Stop(void) ;
uint8 UART_ReadControlRegister(void) ;
void UART_WriteControlRegister(uint8 control) ;

void UART_Init(void) ;
void UART_Enable(void) ;
void UART_SaveConfig(void);
void UART_RestoreConfig(void);
void UART_Sleep(void);
void UART_Wakeup(void);

/* Only if RX is enabled */
#if( (UART_RX_ENABLED) || (UART_HD_ENABLED) )

    #if(UART_RX_INTERRUPT_ENABLED)
        void  UART_EnableRxInt(void) ;
        void  UART_DisableRxInt(void) ;
        CY_ISR_PROTO(UART_RXISR);
    #endif /* UART_RX_INTERRUPT_ENABLED */

    #if (UART_RXHW_ADDRESS_ENABLED)
        void UART_SetRxAddressMode(uint8 addressMode) 
                                                            ;
        void UART_SetRxAddress1(uint8 address) ;
        void UART_SetRxAddress2(uint8 address) ;
    #endif /* End UART_RXHW_ADDRESS_ENABLED */

    void  UART_SetRxInterruptMode(uint8 intSrc) ;
    uint8 UART_ReadRxData(void);
    uint8 UART_ReadRxStatus(void) ;
    uint8 UART_GetChar(void);
    uint16 UART_GetByte(void);
    uint8 UART_GetRxBufferSize(void);
    void UART_ClearRxBuffer(void);

    /* Obsolete functions, defines for backward compatible */
    #define UART_GetRxInterruptSource   UART_ReadRxStatus

#endif /* End (UART_RX_ENABLED) || (UART_HD_ENABLED) */

/* Only if TX is enabled */
#if(UART_TX_ENABLED || UART_HD_ENABLED)

    #if(UART_TX_INTERRUPT_ENABLED)
        void UART_EnableTxInt(void) ;
        void UART_DisableTxInt(void) ;
        CY_ISR_PROTO(UART_TXISR);
    #endif /* UART_TX_INTERRUPT_ENABLED */

