MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\UART.h
    void UART_SetTxInterruptMode(uint8 intSrc) ;
    void UART_WriteTxData(uint8 txDataByte);
    uint8 UART_ReadTxStatus(void) ;
    void UART_PutChar(uint8 txDataByte);
    void UART_PutString(uint8* string);
    void UART_PutArray(uint8* string, uint8 byteCount);
    void UART_PutCRLF(uint8 txDataByte);
    void UART_ClearTxBuffer(void);
    void UART_SetTxAddressMode(uint8 addressMode) ;
    void UART_SendBreak(uint8 retMode);
    uint8 UART_GetTxBufferSize(void);
    /* Obsolete functions, defines for backward compatible */
    #define UART_PutStringConst         UART_PutString
    #define UART_PutArrayConst          UART_PutArray
    #define UART_GetTxInterruptSource   UART_ReadTxStatus
    
#endif /* End UART_TX_ENABLED || UART_HD_ENABLED */

#if(UART_HD_ENABLED)
    void UART_LoadRxConfig(void) ;
    void UART_LoadTxConfig(void) ;
#endif /* End UART_HD_ENABLED */


/***************************************
*          API Constants
***************************************/
/* Parameters for SetTxAddressMode API*/
#define UART_SET_SPACE                              (0x00u)
#define UART_SET_MARK                               (0x01u)

/* Status Register definitions */
#if( (UART_TX_ENABLED) || (UART_HD_ENABLED) )
    #if(UART_TX_INTERRUPT_ENABLED)
        #define UART_TX_VECT_NUM                UART_TXInternalInterrupt__INTC_NUMBER
        #define UART_TX_PRIOR_NUM               UART_TXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_TX_INTERRUPT_ENABLED */
    #if(UART_TX_ENABLED) 
        #define UART_TX_STS_COMPLETE_SHIFT          (0x00u)
        #define UART_TX_STS_FIFO_EMPTY_SHIFT        (0x01u)
        #define UART_TX_STS_FIFO_FULL_SHIFT         (0x02u)
        #define UART_TX_STS_FIFO_NOT_FULL_SHIFT     (0x03u)
    #endif /* UART_TX_ENABLED */
    #if(UART_HD_ENABLED) 
        #define UART_TX_STS_COMPLETE_SHIFT          (0x00u)
        #define UART_TX_STS_FIFO_EMPTY_SHIFT        (0x01u)
        #define UART_TX_STS_FIFO_FULL_SHIFT         (0x05u)  /*needs MD=0*/
        #define UART_TX_STS_FIFO_NOT_FULL_SHIFT     (0x03u)
    #endif /* UART_HD_ENABLED */
    #define UART_TX_STS_COMPLETE                (0x01u << UART_TX_STS_COMPLETE_SHIFT)
    #define UART_TX_STS_FIFO_EMPTY              (0x01u << UART_TX_STS_FIFO_EMPTY_SHIFT)
    #define UART_TX_STS_FIFO_FULL               (0x01u << UART_TX_STS_FIFO_FULL_SHIFT)
    #define UART_TX_STS_FIFO_NOT_FULL           (0x01u << UART_TX_STS_FIFO_NOT_FULL_SHIFT)
#endif /* End (UART_TX_ENABLED) || (UART_HD_ENABLED)*/

#if( (UART_RX_ENABLED) || (UART_HD_ENABLED) )
    #if(UART_RX_INTERRUPT_ENABLED)
        #define UART_RX_VECT_NUM                UART_RXInternalInterrupt__INTC_NUMBER
        #define UART_RX_PRIOR_NUM               UART_RXInternalInterrupt__INTC_PRIOR_NUM
    #endif /* UART_RX_INTERRUPT_ENABLED */
    #define UART_RX_STS_MRKSPC_SHIFT            (0x00u)
    #define UART_RX_STS_BREAK_SHIFT             (0x01u)
    #define UART_RX_STS_PAR_ERROR_SHIFT         (0x02u)
    #define UART_RX_STS_STOP_ERROR_SHIFT        (0x03u)
    #define UART_RX_STS_OVERRUN_SHIFT           (0x04u)
    #define UART_RX_STS_FIFO_NOTEMPTY_SHIFT     (0x05u)
    #define UART_RX_STS_ADDR_MATCH_SHIFT        (0x06u)
    #define UART_RX_STS_SOFT_BUFF_OVER_SHIFT    (0x07u)

    #define UART_RX_STS_MRKSPC                  (0x01u << UART_RX_STS_MRKSPC_SHIFT)
    #define UART_RX_STS_BREAK                   (0x01u << UART_RX_STS_BREAK_SHIFT)
    #define UART_RX_STS_PAR_ERROR               (0x01u << UART_RX_STS_PAR_ERROR_SHIFT)
    #define UART_RX_STS_STOP_ERROR              (0x01u << UART_RX_STS_STOP_ERROR_SHIFT)
    #define UART_RX_STS_OVERRUN                 (0x01u << UART_RX_STS_OVERRUN_SHIFT)
    #define UART_RX_STS_FIFO_NOTEMPTY           (0x01u << UART_RX_STS_FIFO_NOTEMPTY_SHIFT)
    #define UART_RX_STS_ADDR_MATCH              (0x01u << UART_RX_STS_ADDR_MATCH_SHIFT)
    #define UART_RX_STS_SOFT_BUFF_OVER          (0x01u << UART_RX_STS_SOFT_BUFF_OVER_SHIFT)
    #define UART_RX_HW_MASK                     (0x7Fu)
#endif /* End (UART_RX_ENABLED) || (UART_HD_ENABLED) */

/* Control Register definitions */
#define UART_CTRL_HD_SEND_SHIFT                 (0x00u) /* 1 enable TX part in Half Duplex mode */
#define UART_CTRL_HD_SEND_BREAK_SHIFT           (0x01u) /* 1 send BREAK signal in Half Duplez mode */
#define UART_CTRL_MARK_SHIFT                    (0x02u) /* 1 sets mark, 0 sets space */
#define UART_CTRL_PARITY_TYPE0_SHIFT            (0x03u) /* Defines the type of parity implemented */
#define UART_CTRL_PARITY_TYPE1_SHIFT            (0x04u) /* Defines the type of parity implemented */
#define UART_CTRL_RXADDR_MODE0_SHIFT            (0x05u)
#define UART_CTRL_RXADDR_MODE1_SHIFT            (0x06u)
#define UART_CTRL_RXADDR_MODE2_SHIFT            (0x07u)

#define UART_CTRL_HD_SEND                       (0x01u << UART_CTRL_HD_SEND_SHIFT)
#define UART_CTRL_HD_SEND_BREAK                 (0x01u << UART_CTRL_HD_SEND_BREAK_SHIFT)
#define UART_CTRL_MARK                          (0x01u << UART_CTRL_MARK_SHIFT)
#define UART_CTRL_PARITY_TYPE_MASK              (0x03u << UART_CTRL_PARITY_TYPE0_SHIFT)
#define UART_CTRL_RXADDR_MODE_MASK              (0x07u << UART_CTRL_RXADDR_MODE0_SHIFT)

/* StatusI Register Interrupt Enable Control Bits. As defined by the Register map for the AUX Control Register */
#define UART_INT_ENABLE                         (0x10u)

/* Bit Counter (7-bit) Control Register Bit Definitions. As defined by the Register map for the AUX Control Register */
#define UART_CNTR_ENABLE                        (0x20u)

/*   Constants for SendBreak() "retMode" parameter  */
#define UART_SEND_BREAK                         (0x00u)
#define UART_WAIT_FOR_COMLETE_REINIT            (0x01u)
#define UART_REINIT                             (0x02u)
#define UART_SEND_WAIT_REINIT                   (0x03u)

#define UART_OVER_SAMPLE_8                      (8u)
#define UART_OVER_SAMPLE_16                     (16u)

#define UART_BIT_CENTER                         (UART_OVER_SAMPLE_COUNT - 1u)

#define UART_FIFO_LENGTH                        (4u)
#define UART_NUMBER_OF_START_BIT                (1u)

