MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\UART.h
/* 8X always for count7 implementation*/
#define UART_TXBITCTR_BREAKBITS8X   (UART_BREAK_BITS_TX * UART_OVER_SAMPLE_8 - 1u)
/* 8X or 16X for DP implementation*/
#define UART_TXBITCTR_BREAKBITS   (UART_BREAK_BITS_TX * UART_OVER_SAMPLE_COUNT - 1u)

#if (UART_OVER_SAMPLE_COUNT == UART_OVER_SAMPLE_8)
    #define UART_HD_TXBITCTR_INIT   ((UART_BREAK_BITS_TX + \
        UART_NUMBER_OF_START_BIT) * UART_OVER_SAMPLE_COUNT - 1u)
    /* This parameter is increased on the 1 in 2 out of 3 mode to sample voting in the middle */
    #define UART_HD_RXBITCTR_INIT   ((UART_BREAK_BITS_RX + \
    UART_NUMBER_OF_START_BIT) * UART_OVER_SAMPLE_COUNT - 1u + \
    (UART_OVER_SAMPLE_COUNT / 2u) + (UART_USE23POLLING * 2u) - 1u)
#else /* UART_OVER_SAMPLE_COUNT == UART_OVER_SAMPLE_16 */
    #define UART_HD_TXBITCTR_INIT   (8u * UART_OVER_SAMPLE_COUNT - 1u)
    #define UART_HD_RXBITCTR_INIT   (7u * UART_OVER_SAMPLE_COUNT - 1u  +  \
       (UART_OVER_SAMPLE_COUNT / 2u) + (UART_USE23POLLING * 2u) - 1u)
#endif /* End UART_OVER_SAMPLE_COUNT */


/***************************************
* Enumerated Types and Parameters
***************************************/

#define UART__B_UART__AM_SW_BYTE_BYTE 1
#define UART__B_UART__AM_SW_DETECT_TO_BUFFER 2
#define UART__B_UART__AM_HW_BYTE_BY_BYTE 3
#define UART__B_UART__AM_HW_DETECT_TO_BUFFER 4
#define UART__B_UART__AM_NONE 0

#define UART__B_UART__NONE_REVB 0
#define UART__B_UART__EVEN_REVB 1
#define UART__B_UART__ODD_REVB 2
#define UART__B_UART__MARK_SPACE_REVB 3


/***************************************
*    Initial Parameter Constants
***************************************/

#define UART_TXBUFFERSIZE           (255u)
#define UART_RXBUFFERSIZE           (64u)
/* UART shifts max 8 bits, Mark/Space functionality working if 9 selected */
#define UART_NUMBER_OF_DATA_BITS    ((8u > 8u) ? 8u : 8u)
#define UART_NUMBER_OF_STOP_BITS    (1u)

#if (UART_RXHW_ADDRESS_ENABLED)
    #define UART_RXAddressMode      (0u)
    #define UART_RXHWADDRESS1       (0u)
    #define UART_RXHWADDRESS2       (0u)
#endif /* End EnableHWAddress */

#define UART_INIT_RX_INTERRUPTS_MASK \
                                          (1 << UART_RX_STS_FIFO_NOTEMPTY_SHIFT) \
                                        | (0 << UART_RX_STS_MRKSPC_SHIFT) \
                                        | (0 << UART_RX_STS_ADDR_MATCH_SHIFT) \
                                        | (0 << UART_RX_STS_PAR_ERROR_SHIFT) \
                                        | (0 << UART_RX_STS_STOP_ERROR_SHIFT) \
                                        | (0 << UART_RX_STS_BREAK_SHIFT) \
                                        | (0 << UART_RX_STS_OVERRUN_SHIFT)

#define UART_INIT_TX_INTERRUPTS_MASK \
                                          (0 << UART_TX_STS_COMPLETE_SHIFT) \
                                        | (1 << UART_TX_STS_FIFO_EMPTY_SHIFT) \
                                        | (0 << UART_TX_STS_FIFO_FULL_SHIFT) \
                                        | (0 << UART_TX_STS_FIFO_NOT_FULL_SHIFT)


/***************************************
*              Registers
***************************************/

#ifdef UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG
    #define UART_CONTROL_REG \
                            (* (reg8 *) UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG )
    #define UART_CONTROL_PTR \
                            (  (reg8 *) UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG )
#endif /* End UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG */

#if(UART_TX_ENABLED)
    #define UART_TXDATA_REG          (* (reg8 *) UART_BUART_sTX_TxShifter_u0__F0_REG)
    #define UART_TXDATA_PTR          (  (reg8 *) UART_BUART_sTX_TxShifter_u0__F0_REG)

    #define UART_TXSTATUS_REG        (* (reg8 *) UART_BUART_sTX_TxSts__STATUS_REG)
    #define UART_TXSTATUS_PTR        (  (reg8 *) UART_BUART_sTX_TxSts__STATUS_REG)
    #define UART_TXSTATUS_MASK_REG   (* (reg8 *) UART_BUART_sTX_TxSts__MASK_REG)
    #define UART_TXSTATUS_MASK_PTR   (  (reg8 *) UART_BUART_sTX_TxSts__MASK_REG)
    #define UART_TXSTATUS_ACTL_REG   (* (reg8 *) UART_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)
    #define UART_TXSTATUS_ACTL_PTR   (  (reg8 *) UART_BUART_sTX_TxSts__STATUS_AUX_CTL_REG)

    /* DP clock */
    #if(UART_TXCLKGEN_DP)
        #define UART_TXBITCLKGEN_CTR_REG        \
                                        (* (reg8 *) UART_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_TXBITCLKGEN_CTR_PTR        \
                                        (  (reg8 *) UART_BUART_sTX_sCLOCK_TxBitClkGen__D0_REG)
        #define UART_TXBITCLKTX_COMPLETE_REG    \
                                        (* (reg8 *) UART_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
        #define UART_TXBITCLKTX_COMPLETE_PTR    \
                                        (  (reg8 *) UART_BUART_sTX_sCLOCK_TxBitClkGen__D1_REG)
    #else     /* Count7 clock*/
        #define UART_TXBITCTR_PERIOD_REG    \
                                        (* (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_TXBITCTR_PERIOD_PTR    \
                                        (  (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__PERIOD_REG)
        #define UART_TXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_TXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__CONTROL_AUX_CTL_REG)
        #define UART_TXBITCTR_COUNTER_REG   \
                                        (* (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
        #define UART_TXBITCTR_COUNTER_PTR   \
                                        (  (reg8 *) UART_BUART_sTX_sCLOCK_TxBitCounter__COUNT_REG)
    #endif /* UART_TXCLKGEN_DP */

#endif /* End UART_TX_ENABLED */

#if(UART_HD_ENABLED)

    #define UART_TXDATA_REG             (* (reg8 *) UART_BUART_sRX_RxShifter_u0__F1_REG )
    #define UART_TXDATA_PTR             (  (reg8 *) UART_BUART_sRX_RxShifter_u0__F1_REG )

    #define UART_TXSTATUS_REG           (* (reg8 *) UART_BUART_sRX_RxSts__STATUS_REG )
    #define UART_TXSTATUS_PTR           (  (reg8 *) UART_BUART_sRX_RxSts__STATUS_REG )
    #define UART_TXSTATUS_MASK_REG      (* (reg8 *) UART_BUART_sRX_RxSts__MASK_REG )
    #define UART_TXSTATUS_MASK_PTR      (  (reg8 *) UART_BUART_sRX_RxSts__MASK_REG )
    #define UART_TXSTATUS_ACTL_REG      (* (reg8 *) UART_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_TXSTATUS_ACTL_PTR      (  (reg8 *) UART_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End UART_HD_ENABLED */

#if( (UART_RX_ENABLED) || (UART_HD_ENABLED) )
    #define UART_RXDATA_REG             (* (reg8 *) UART_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_RXDATA_PTR             (  (reg8 *) UART_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_RXADDRESS1_REG         (* (reg8 *) UART_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_RXADDRESS1_PTR         (  (reg8 *) UART_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_RXADDRESS2_REG         (* (reg8 *) UART_BUART_sRX_RxShifter_u0__D1_REG )
    #define UART_RXADDRESS2_PTR         (  (reg8 *) UART_BUART_sRX_RxShifter_u0__D1_REG )

    #define UART_RXBITCTR_PERIOD_REG    (* (reg8 *) UART_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_RXBITCTR_PERIOD_PTR    (  (reg8 *) UART_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_RXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_RXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_RXBITCTR_COUNTER_REG   (* (reg8 *) UART_BUART_sRX_RxBitCounter__COUNT_REG )
    #define UART_RXBITCTR_COUNTER_PTR   (  (reg8 *) UART_BUART_sRX_RxBitCounter__COUNT_REG )

