MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\UART.h
    #define UART_RXSTATUS_REG           (* (reg8 *) UART_BUART_sRX_RxSts__STATUS_REG )
    #define UART_RXSTATUS_PTR           (  (reg8 *) UART_BUART_sRX_RxSts__STATUS_REG )
    #define UART_RXSTATUS_MASK_REG      (* (reg8 *) UART_BUART_sRX_RxSts__MASK_REG )
    #define UART_RXSTATUS_MASK_PTR      (  (reg8 *) UART_BUART_sRX_RxSts__MASK_REG )
    #define UART_RXSTATUS_ACTL_REG      (* (reg8 *) UART_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_RXSTATUS_ACTL_PTR      (  (reg8 *) UART_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End  (UART_RX_ENABLED) || (UART_HD_ENABLED) */

#if(UART_INTERNAL_CLOCK_USED)
    /* Register to enable or disable the digital clocks */
    #define UART_INTCLOCK_CLKEN_REG     (* (reg8 *) UART_IntClock__PM_ACT_CFG)
    #define UART_INTCLOCK_CLKEN_PTR     (  (reg8 *) UART_IntClock__PM_ACT_CFG)

    /* Clock mask for this clock. */
    #define UART_INTCLOCK_CLKEN_MASK    UART_IntClock__PM_ACT_MSK
#endif /* End UART_INTERNAL_CLOCK_USED */


/***************************************
* Renamed global variables or defines 
* for backward compatible
***************************************/

#define UART_initvar                    UART_initVar

#define UART_RX_Enabled                 UART_RX_ENABLED
#define UART_TX_Enabled                 UART_TX_ENABLED
#define UART_HD_Enabled                 UART_HD_ENABLED
#define UART_RX_IntInterruptEnabled     UART_RX_INTERRUPT_ENABLED
#define UART_TX_IntInterruptEnabled     UART_TX_INTERRUPT_ENABLED
#define UART_InternalClockUsed          UART_INTERNAL_CLOCK_USED
#define UART_RXHW_Address_Enabled       UART_RXHW_ADDRESS_ENABLED
#define UART_OverSampleCount            UART_OVER_SAMPLE_COUNT
#define UART_ParityType                 UART_PARITY_TYPE

#if( UART_TX_ENABLED && (UART_TXBUFFERSIZE > UART_FIFO_LENGTH))
    #define UART_TXBUFFER               UART_txBuffer
    #define UART_TXBUFFERREAD           UART_txBufferRead 
    #define UART_TXBUFFERWRITE          UART_txBufferWrite 
#endif /* End UART_TX_ENABLED */
#if( ( UART_RX_ENABLED || UART_HD_ENABLED ) && \
     (UART_RXBUFFERSIZE > UART_FIFO_LENGTH) )
    #define UART_RXBUFFER               UART_rxBuffer
    #define UART_RXBUFFERREAD           UART_rxBufferRead 
    #define UART_RXBUFFERWRITE          UART_rxBufferWrite 
    #define UART_RXBUFFERLOOPDETECT     UART_rxBufferLoopDetect
    #define UART_RXBUFFER_OVERFLOW      UART_rxBufferOverflow
#endif /* End UART_RX_ENABLED */

#ifdef UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG
    #define UART_CONTROL                UART_CONTROL_REG 
#endif /* End UART_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG */

#if(UART_TX_ENABLED)
    #define UART_TXDATA                 UART_TXDATA_REG
    #define UART_TXSTATUS               UART_TXSTATUS_REG
    #define UART_TXSTATUS_MASK          UART_TXSTATUS_MASK_REG   
    #define UART_TXSTATUS_ACTL          UART_TXSTATUS_ACTL_REG
    /* DP clock */
    #if(UART_TXCLKGEN_DP)
        #define UART_TXBITCLKGEN_CTR        UART_TXBITCLKGEN_CTR_REG
        #define UART_TXBITCLKTX_COMPLETE    UART_TXBITCLKTX_COMPLETE_REG
    #else     /* Count7 clock*/
        #define UART_TXBITCTR_PERIOD        UART_TXBITCTR_PERIOD_REG
        #define UART_TXBITCTR_CONTROL       UART_TXBITCTR_CONTROL_REG
        #define UART_TXBITCTR_COUNTER       UART_TXBITCTR_COUNTER_REG
    #endif /* UART_TXCLKGEN_DP */
#endif /* End UART_TX_ENABLED */

#if(UART_HD_ENABLED)
    #define UART_TXDATA                 UART_TXDATA_REG
    #define UART_TXSTATUS               UART_TXSTATUS_REG
    #define UART_TXSTATUS_MASK          UART_TXSTATUS_MASK_REG   
    #define UART_TXSTATUS_ACTL          UART_TXSTATUS_ACTL_REG
#endif /* End UART_HD_ENABLED */

#if( (UART_RX_ENABLED) || (UART_HD_ENABLED) )
    #define UART_RXDATA                 UART_RXDATA_REG             
    #define UART_RXADDRESS1             UART_RXADDRESS1_REG
    #define UART_RXADDRESS2             UART_RXADDRESS2_REG
    #define UART_RXBITCTR_PERIOD        UART_RXBITCTR_PERIOD_REG
    #define UART_RXBITCTR_CONTROL       UART_RXBITCTR_CONTROL_REG
    #define UART_RXBITCTR_COUNTER       UART_RXBITCTR_COUNTER_REG
    #define UART_RXSTATUS               UART_RXSTATUS_REG
    #define UART_RXSTATUS_MASK          UART_RXSTATUS_MASK_REG
    #define UART_RXSTATUS_ACTL          UART_RXSTATUS_ACTL_REG
#endif /* End  (UART_RX_ENABLED) || (UART_HD_ENABLED) */

#if(UART_INTERNAL_CLOCK_USED)
    #define UART_INTCLOCK_CLKEN         UART_INTCLOCK_CLKEN_REG
#endif /* End UART_INTERNAL_CLOCK_USED */

#endif  /* CY_UART_UART_H */


/* [] END OF FILE */
